# One Hot Encoder and get Dummies

In [1]:
import pandas as pd

In [3]:
df = pd.read_excel('onedata.xlsx')

In [4]:
df

   buyer  fruits  gender  value
0    ali   apple    male      2
1   noor   mango    male      3
2  wajid  orange  female      4
3  karim  banana    male      4

In [8]:
pd.get_dummies(data=df,columns=['buyer','fruits','gender'],dtype=int)

,value,buyer_ali,buyer_karim,buyer_noor,buyer_wajid,fruits_apple,fruits_banana,fruits_mango,fruits_orange,gender_female,gender_male
0,2,1,0,0,0,1,0,0,0,0,1
1,3,0,0,1,0,0,0,1,0,0,1
2,4,0,0,0,1,0,0,0,1,1,0
3,4,0,1,0,0,0,1,0,0,0,1

In [9]:
pd.get_dummies(data=df,columns=['buyer','fruits','gender'],dtype=int, drop_first='first')

,value,buyer_karim,buyer_noor,buyer_wajid,fruits_banana,fruits_mango,fruits_orange,gender_male
0,2,0,0,0,0,0,0,1
1,3,0,1,0,0,1,0,1
2,4,0,0,1,0,0,1,0
3,4,1,0,0,1,0,0,1

# OneHotEncoder

In [18]:
from sklearn.preprocessing import OneHotEncoder

In [29]:
ohe = OneHotEncoder(drop='first', dtype=int, sparse_output=False)

In [30]:
df_transf = ohe.fit_transform(df[['buyer','fruits','gender']])

In [31]:
df_transf

array([[0, 0, 0, 0, 0, 0, 1],
       [0, 1, 0, 0, 1, 0, 1],
       [0, 0, 1, 0, 0, 1, 0],
       [1, 0, 0, 1, 0, 0, 1]])

# This function is used for getting column name after transform

get_feature_names_out()

In [35]:
cols = ohe.get_feature_names_out()

In [36]:
cols

array(['buyer_karim', 'buyer_noor', 'buyer_wajid', 'fruits_banana',
       'fruits_mango', 'fruits_orange', 'gender_male'], dtype=object)

In [38]:
df_transf = pd.DataFrame(data = df_transf, columns = cols)

In [39]:
df_transf

,buyer_karim,buyer_noor,buyer_wajid,fruits_banana,fruits_mango,fruits_orange,gender_male
0,0,0,0,0,0,0,1
1,0,1,0,0,1,0,1
2,0,0,1,0,0,1,0
3,1,0,0,1,0,0,1